#include <stdio.h>

// Функція для перевірки, чи можна побудувати трикутник з довжинами сторін
int isTriangle(int a, int b, int c) {
    if (a <= 0 || b <= 0 || c <= 0) {
        return 0; // Якщо якась зі сторін має недопустиму довжину (невід'ємна), трикутник неможливий
    }
  
    if (a + b > c && b + c > a && c + a > b) {
        return 1; // Якщо виконується умова трикутника (сума двох сторін більша за третю), то можна побудувати трикутник
    }

    return 0; // У всіх інших випадках трикутник неможливий
}

int main() {
    int a, b, c;

    printf("Введіть довжину першої сторони: ");
    scanf("%d", &a);
    printf("Введіть довжину другої сторони: ");
    scanf("%d", &b);
    printf("Введіть довжину третьої сторони: ");
    scanf("%d", &c);

    FILE* file = fopen("triangle.txt", "a"); // Відкриваємо файл у режимі допису 
  
    if (file == NULL) {
        printf("Помилка відкриття файлу.\n");
        return 1; // Вихід з програми з помилковим кодом
    }

    fprintf(file, "%d %d %d\n", a, b, c); // Записуємо три числа у файл

    if (isTriangle(a, b, c)) {
        fprintf(file, "Можна побудувати трикутник.\n");
    } else {
        fprintf(file, "Не можна побудувати трикутник.\n");
    }

    fclose(file); // Закриваємо файл

    return 0;
}
